{
  "name": "Andrew Stalker",
  "title": "Principal Software Engineer",
  "contact": {
    "email": "drew.jst@gmail.com",
    "phone": "765.237.2841",
    "github": "https://github.com/drewjst",
    "linkedin": "https://www.linkedin.com/in/andrew-stalker-7b642778"
  },
  "summary": "Principal Software Engineer driving technical direction and cross-domain execution for distributed, event-driven financial platforms supporting Liberty Mutual's $7.1B Small Commercial portfolio. Partner with solution architects and product leadership to translate architectural strategy into high-impact, reliable delivery across five product areas, aligning 12+ engineers around service boundaries, modernization sequencing, and production resilience in a regulated environment. Hands-on distributed systems expertise (Java/Spring Boot, Go, event-driven microservices, AWS/GCP) combined with cross-team technical leadership, modernization strategy, and AI-assisted development adoption.",
  "experience": [
    {
      "title": "Principal Software Engineer",
      "company": "Liberty Mutual Insurance",
      "startDate": "Aug 2023",
      "endDate": "Present",
      "subtitle": "Technical lead partnering with solution architects and product leadership to drive cross-domain modernization initiatives across multiple Small Commercial product areas.",
      "highlights": [
        "Drove cross-domain technical execution for Liberty Mutual's $7.1B Small Commercial portfolio, aligning 12+ engineers across US and India around service boundaries, modernization sequencing, and reliability strategy across five product domains.",
        "Partnered with architects to formalize and institutionalize event-driven integration standards across product teams, reducing cross-domain coupling and enabling independent deployability.",
        "Introduced and operationalized AI-assisted development workflows across the engineering organization, establishing governance guardrails and measurable adoption standards that improved time-to-market by 30% while maintaining audit compliance.",
        "Delivered BOP 3.0 and multiple portfolio products (Workers Comp, Commercial Package, Simple BOP) with zero major production disruptions; selected to lead high-ambiguity initiatives including Workers Comp 2.0 and ISO 2026 adoption, organizing PI workshops and driving cross-discipline alignment.",
        "Partnered with solution architects and domain stakeholders to drive enterprise adoption of the ISO 2026 Classification System, refactoring core data models and coordinating schema evolution across dependent services while preserving production stability.",
        "Authored and socialized Architecture Decision Records (ADRs) in collaboration with architects and senior engineers to formalize cross-layer design decisions and reduce rework across UI, BFF, and API systems.",
        "Mentored engineers across experience levels through code reviews, design discussions, and technical workshops, strengthening engineering standards and promoting a culture of continuous improvement."
      ]
    },
    {
      "title": "Senior Software Engineer",
      "company": "Liberty Mutual Insurance",
      "startDate": "Apr 2020",
      "endDate": "Aug 2023",
      "highlights": [
        "Led monolith-to-microservices decomposition strategy, establishing API contract standards and enabling independent deployability across product domains.",
        "Built and launched Farm MVP, introducing Farm AG classifications and hazard grading across all states and enabling a new business line.",
        "Designed event-driven APIs and third-party integrations (Experian, NCCI, regulatory systems) with caching and resilience patterns to reduce latency and external dependency risk.",
        "Improved throughput via multithreaded and asynchronous processing; strengthened monitoring and deployment pipelines to increase reliability and reduce MTTR."
      ]
    },
    {
      "title": "Software Engineer",
      "company": "Liberty Mutual Insurance",
      "startDate": "Jan 2017",
      "endDate": "Apr 2020",
      "highlights": [
        "Built Simple BOP as a greenfield platform, defining initial service architecture and core domain logic; scaled into a primary growth driver within the portfolio.",
        "Implemented resilient third-party integrations and contributed to event-driven migration of legacy components."
      ]
    },
    {
      "title": "Lead Full Stack Web Developer",
      "company": "Purdue University",
      "startDate": "Mar 2015",
      "endDate": "Dec 2016",
      "highlights": [
        "Built and maintained enterprise infrastructure management systems using C#/ASP.NET and SQL Server; optimized complex queries and delivered responsive web interfaces."
      ]
    }
  ],
  "skills": {
    "Architecture": [
      "Distributed Systems",
      "Event-Driven Architecture",
      "Microservices",
      "API-First Design",
      "Domain Boundaries",
      "CQRS",
      "Async Processing",
      "Kafka"
    ],
    "Languages": [
      "Java (Spring Boot)",
      "Go",
      "TypeScript (Angular/NgRx, React)",
      "Kotlin",
      "Python",
      "C#"
    ],
    "Cloud & Infrastructure": [
      "AWS (EC2, RDS, MSK)",
      "GCP (Cloud Run, Cloud SQL)",
      "PostgreSQL",
      "MySQL",
      "DynamoDB",
      "Docker",
      "CI/CD"
    ],
    "Reliability & Operations": [
      "Production Reliability",
      "Monitoring (Datadog, Splunk)",
      "Incident Triage"
    ],
    "Leadership": [
      "Cross-Team Technical Direction",
      "Architectural Decision Ownership",
      "Mentorship"
    ]
  },
  "education": [
    {
      "school": "Purdue University",
      "degree": "Bachelor of Science",
      "field": "Computer & Information Technology",
      "graduationDate": "2013–2016",
      "details": "Software Engineering Emphasis | Minor in Communication"
    }
  ]
}
