{
  "name": "Andrew Stalker",
  "title": "Principal Software Engineer",
  "contact": {
    "email": "drew.jst@gmail.com",
    "phone": "xxx.xxx.2841",
    "github": "https://github.com",
    "linkedin": "www.linkedin.com/in/andrew-stalker-7b642778"
  },
  "summary": "Mission-driven Principal Software Engineer and US Army Veteran with 9+ years of experience leading large-scale digital transformations in high-stakes environments. Expert in modernizing legacy insurance monoliths into cloud-native microservices while maintaining zero-downtime tolerance. Architect of high-velocity development cultures, leveraging Agentic AI to accelerate delivery by 30%. Proven in high-pressure environments—from Army deployments to production launches—delivering scalable solutions that prioritize clarity, iteration, and efficiency.",
  "experience": [
    {
      "title": "Principal Software Engineer",
      "company": "Liberty Mutual Insurance",
      "startDate": "Aug 2023",
      "endDate": "Present",
      "highlights": [
        "Spearheaded technical leadership for the Small Commercial Products Tech team, guiding the development of system, technical, and product standards while leading the end-to-end delivery of flagship products, including the current build of the new Workers Comp product on a modern scalable stack (Angular/TypeScript + Java/Spring).",
        "Shipped multiple products and enhancements, delivering across the small commercial portfolio (BOP, Commercial Package, Simple BOP, Auto), consistently enhancing core functionality with zero major disruptions.",
        "Led the cross-functional adoption of the ISO 2026 Classification System, making critical architectural decisions that enabled portfolio growth without disrupting existing high-volume workflows.",
        "Spearheaded the architectural design of a cloud-native distributed microservices platform, guiding multiple teams in the adoption of an event-driven enrichment pattern; established asynchronous ‘listeners’ as the technical standard for real-time data ingestion, which improved data integrity and reduced frontend latency.",
        "Led GitHub migrations and legacy refactoring in regulated insurance, directing secure API designs and compliance enhancements—boosting developer productivity 25% and resilience for commercial products.",
        "Force Multiplication via AI: Led a cross-functional pilot for Agentic AI integration, establishing technical standards that reduced total time-to-market for new features by 30% across the department.",
        "Implemented Angular + NgRx for predictable data flows and scalable state management, streamlining front-end development and reducing UI bugs by establishing reusable patterns."
      ]
    },
    {
      "title": "Senior Software Engineer",
      "company": "Liberty Mutual Insurance",
      "startDate": "Apr 2020",
      "endDate": "Aug 2023",
      "highlights": [
        "Built robust, scalable full-stack web applications using Angular for front-end and Java/Spring Boot for back-end, supporting agile sprints that delivered high-quality solutions on time for insurance product enhancements.",
        "Performance Engineering: Engineered multithreaded and asynchronous Java algorithms that significantly improved search responsiveness and UX for high-transaction insurance workflows.",
        "Committed to professional growth by tracking industry trends, attending conferences, and sharing knowledge via internal workshops, mentoring juniors to boost team-wide adoption of best practices."
      ]
    },
    {
      "title": "Software Engineer",
      "company": "Liberty Mutual Insurance",
      "startDate": "Dec 2017",
      "endDate": "April 2020",
      "highlights": [
        "Pioneered early innovations in simplifying small commercial insurance workflows, conceiving and developing core features that launched Simple BOP—rapidly becoming the primary growth driver for the small commercial portfolio.",
        "Developed and optimized full-stack features for enterprise insurance systems, enhancing performance and scalability to support growing transaction volumes.",
        "Collaborated on agile refactoring of legacy codebases, improving reliability and long-term maintainability."
      ]
    },
    {
      "title": "Lead Full Stack Web Developer",
      "company": "Purdue University",
      "startDate": "Mar 2015",
      "endDate": "Dec 2016",
      "highlights": [
        "Built and maintained Risque, an enterprise infrastructure management suite in C#/ASP.NET with SQL Server back-end.",
        "Created and optimized complex SQL queries, enhancing data retrieval efficiency for infrastructure management.",
        "Optimized complex SQL queries and delivered responsive web interfaces, improving data accessibility and user experience across devices."
      ]
    },
    {
      "title": "Signals Intelligence Analyst & Cavalry Scout / Scout Team Leader",
      "company": "US Army - Airborne / Jumpmaster",
      "startDate": "Feb 2006",
      "endDate": "Jul 2013",
      "highlights": [
        "Systems Intelligence: Led SIGINT and Reconnaissance teams in high-pressure combat environments, utilizing pattern recognition and real-time data analysis—skills directly applied today to complex system debugging and architectural optimization.",
        "Leadership under Pressure: As a Jumpmaster and Scout Team Leader, managed mission-critical operations where precision and clarity were paramount, fostering a \"mission-first\" engineering mindset.",
        "Operation Iraqi Freedom (2006–2008) and Operation Enduring Freedom (2011–2012)."
      ]
    }
  ],
  "skills": {
    "Languages & Frameworks": [
      "Java (Spring Boot)",
      "TypeScript / Javascript",
      "Angular (incl. NgRx)",
      "C#",
      "ASP.NET"
    ],
    "Data & Cloud": [
      "SQL Server",
      "PostgreSQL",
      "AWS (microservices orchestration)",
      "Microsoft SQL Server"
    ],
    "AI & DevOps": [
      "GitHub Copilot",
      "Agentic AI",
      "Agile/Scrum",
      "CI/CD (GitHub Actions, Bamboo)",
      "DataDog"
    ],
    "Engineering Leadership": [
      "Technical Standards & Roadmap",
      "Multi-Layered System Design",
      "Legacy System Modernization (monolith-to-microservices)",
      "Agentic AI",
      "Cross-Functional Team Leadership"
    ]
  },
  "education": [
    {
      "school": "Purdue University",
      "degree": "Bachelor of Science",
      "field": "Computer & Information Technology",
      "graduationDate": "2013-2016",
      "details": "Emphasis on Software Engineering. Minor in Communication. Dean's List & Semester Honors"
    }
  ]
}
